In [1]:
import pandas as pd

In [2]:
d1 = {'customer_id':[1,2,3,4,5,6],
  'product':['Oven','Oven','Oven','Television','Television','Television']
     }
df1 = pd.DataFrame(d1)
 
d2 = {'customer_id':[2,4,6,8],
    'state':['California','California','Texas', 'Hell']}
df2 = pd.DataFrame(d2)

In [3]:
df1

   customer_id     product
0            1        Oven
1            2        Oven
2            3        Oven
3            4  Television
4            5  Television
5            6  Television

In [4]:
df2

   customer_id       state
0            2  California
1            4  California
2            6       Texas
3            8        Hell

#### Inner 조인 수행.

In [5]:
inner_join_result = pd.merge(df1, df2, on='customer_id', how='inner')
inner_join_result

   customer_id     product       state
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

In [6]:
inner_join_result = df1.merge(df2, on='customer_id', how='inner')
inner_join_result

   customer_id     product       state
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

#### Left Outer 조인 수행.

In [7]:
left_outer_join_result = df1.merge(df2, on='customer_id', how='left')
left_outer_join_result

   customer_id     product       state
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

#### Right Outer 조인 수행.

In [8]:
right_outer_join_result = df1.merge(df2, on='customer_id', how='right')
right_outer_join_result

   customer_id     product       state
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas
3            8         NaN        Hell

In [9]:
left_outer_join_result_01 = df2.merge(df1, on='customer_id', how='left')
left_outer_join_result_01

   customer_id       state     product
0            2  California        Oven
1            4  California  Television
2            6       Texas  Television
3            8        Hell         NaN

#### Full outer join 수행.

In [10]:
full_outer_join_result = pd.merge(df1, df2, on='customer_id', how='outer')
full_outer_join_result

   customer_id     product       state
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas
6            8         NaN        Hell